package com.lesson5.lesson6;

import com.lesson5.hm.Robot;

import java.util.Arrays;

public class Main {
    public static void main(String[] args) {
        //  тип_данных название_массива [];
        //  тип_данных [] название_массива;

        int [] numbers;
        int [] numbers1 = new int[] {1, 3, 4, 3 ,5 ,6};

        System.out.println(Arrays.toString(numbers1));

        //Task 1
        /*Массив int на 5 элементов, 2,6,9,1,3
        *
        * Найти максимальное значение в этом массиве
        *
        * */

        //Task 2
        /*Создайте 2 массива из 5 случайных целых чисел из отрезка [0;5] каждый,
        выведите массивы на экран в двух отдельных строках.
        Посчитайте среднее арифметическое элементов каждого массива и сообщите,
        для какого из массивов это значение оказалось больше
        (либо сообщите, что их средние арифметические равны).




        Создать метод который принимает массив и возвращает его среднее арифметическое
        * */

        //Task 3
        /*
        * Нужно создать массив из всех нечетных чисел из диапазона от 1 до 99 , вывести его на экран
        * Дополнительно вывести этот массив наборот (в обратном порядке) через for i цикл
        *
        *
        * */

        //Task 4

        /*
        * Создать массив строк, один элемент массива 1 слово, можно взять стих/песню с интернета
        *
        *
        * в цикле найти все слова которые содержат букву "а"
        *
        * для строк метод contains
        *
        * */

    }
}
