package com.lesson5.cw;

public class Main {
    public static void main(String[] args) {
//        for (int i = 0; i < 5; i++) {
//            System.out.println(i);
//        }

//        int i = 0;
//        for (int i = 2 ;i < 2; i++){
//            System.out.println(i);
//        }

//        System.out.println("finish");


        int i = 0;
//        do {
//            System.out.println("test");
//        } while (i < 2);


        while (i < 5){
            System.out.println(1);
            ++i;
            if (i == 3){
            }

        }

        /*Task 1

        * В стране XYZ население равно 10 миллионов человек. Рождаемость составляет 14 человек на 1000 человек,
        * смертность - 8 человек. Рассчитайте, какая численность населения будет через 10 лет, принимая во внимание,
        * что показатели рождаемости и смертности постоянны.
        * */


        /*Task 2

        * В стране XYZ население равно 10 миллионов человек. Рождаемость составляет 14 человек на 1000 человек,
        * смертность - 8 человек. Каждый год рождается и умирает на 1 человек, меньше чем в предыдущий год.
        * Рассчитайте, какая численность населения будет через 10 лет,
        * учитывая, что рождаемость не может быть меньше 7 человек на 1000 человек,
        * а смертностность не может быть меньше 6 человек на 1000 человек.
        * */

        /*Task 3

        * Напишите программу, которая выводит на консоль таблицу умножения - таблица Пифагора
        *
        * \t - табуляция
        * \n - переход на новую строку
        * */


        /*Task 4
            Калькулятор через while
            после подсчета спрашивать хотим ли продолжить работу
         */

    }
}
