package lesson8;

import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
//        Scanner scanner = new Scanner(System.in);
//        int i = scanner.nextInt();
//        Days day = Days.getDayByNum(i);
//        System.out.println(day.getName());

//        System.out.println(Days.FRIDAY.getNum());


        /*
        * Придумать 3 табл. отобразить их в классах
        * 
        * 1. Для каждой таблички написать Select, Insert, Update
        * 2. Создать интерфейс с поведением на вашу тему
        * 3. Создавать классы с учетом наследования
        * 4. Продемонстрировать скрытие реализации
        *
        *
        *
        *
        *
        *
        *
        * */
    }


    /* Вера - Select and Update
    SELECT * FROM Employee WHERE age = 16;
    SELECT name, age FROM Employee  WHERE age = 16;
    UPDATE Employee
    SET name = "Max";
    age = 16;
    height = 67 WHERE age = 16;
    * */


    /*Гордей - Insert and Delete
     *  INSERT INTO Employee (age, name, height)
     *                VALUES (16, 'Max', 67);
     *
     * DELETE FROM Employee
     * WHERE id = 44
     * */
}